load-testing/tmp.txt
  █ TOTAL RESULTS 

    checks_total.......................: 16199  77.186661/s
    checks_succeeded...................: 97.92% 15863 out of 16199
    checks_failed......................: 2.07%  336 out of 16199

    ✗ is status 200
      ↳  97% — ✓ 15863 / ✗ 336

    HTTP
    http_req_blocked........................................................: avg=3.72s    min=0s       med=2µs      max=2m46s    p(90)=8.63s  p(95)=22.76s
    http_req_connecting.....................................................: avg=894.43ms min=0s       med=0s       max=29.71s   p(90)=2.18s  p(95)=3.92s 
    http_req_duration.......................................................: avg=8.03s    min=0s       med=1.78s    max=2m39s    p(90)=20.41s p(95)=36.84s
      { expected_response:true }............................................: avg=8.2s     min=271.24ms med=1.9s     max=2m39s    p(90)=20.9s  p(95)=37.27s
    http_req_failed.........................................................: 2.07%  336 out of 16199
    http_req_receiving......................................................: avg=5.37s    min=0s       med=420.66ms max=2m39s    p(90)=13.29s p(95)=28.49s
    http_req_sending........................................................: avg=176.67µs min=0s       med=70µs     max=120.45ms p(90)=256µs  p(95)=580µs 
    http_req_tls_handshaking................................................: avg=2.82s    min=0s       med=0s       max=2m26s    p(90)=1.11s  p(95)=20.94s
    http_req_waiting........................................................: avg=2.65s    min=0s       med=738.07ms max=2m33s    p(90)=6.17s  p(95)=9.6s  
    http_reqs...............................................................: 16199  77.186661/s

    EXECUTION
    iteration_duration......................................................: avg=13.28s   min=1.27s    med=4.15s    max=2m58s    p(90)=33.42s p(95)=1m3s  
    iterations..............................................................: 16176  77.077068/s
    vus.....................................................................: 4      min=4            max=2000
    vus_max.................................................................: 2000   min=2000         max=2000

    NETWORK
    data_received...........................................................: 1.4 GB 6.9 MB/s
    data_sent...............................................................: 13 MB  62 kB/s



running (3m29.9s), 0000/2000 VUs, 16176 complete and 748 interrupted iterations
default ✓ [======================================] 0000/2000 VUs  3m0s